MJPAI_GETPAI = true  --起牌  
MJPAI_PUTPAI = false --打牌

GCardScale = 0.8
GCardWidth = 79 * GCardScale
GCardHeight = 117 * GCardScale

mjCardType = {
	mj_wan = 0,
	mj_bing = 1,
	mj_tiao = 2,
	mj_feng = 3,
	mj_zfb = 4,
	mj_hua = 5
}

mjArray= {
	1, 2, 3, 4, 5, 6, 7, 8, 9,  --万
	1, 2, 3, 4, 5, 6, 7, 8, 9,
	1, 2, 3, 4, 5, 6, 7, 8, 9,
	1, 2, 3, 4, 5, 6, 7, 8, 9,
	11, 12, 13, 14, 15, 16, 17, 18, 19,  --筒
	11, 12, 13, 14, 15, 16, 17, 18, 19,
	11, 12, 13, 14, 15, 16, 17, 18, 19,
	11, 12, 13, 14, 15, 16, 17, 18, 19,
	21, 22, 23, 24, 25, 26, 27, 28, 29,
	21, 22, 23, 24, 25, 26, 27, 28, 29,
	21, 22, 23, 24, 25, 26, 27, 28, 29,
	21, 22, 23, 24, 25, 26, 27, 28, 29,  --条
	31, 32, 33, 34,  --东南西北
	31, 32, 33, 34,
	31, 32, 33, 34,
	31, 32, 33, 34,
	41, 42, 43,  --中发白
	41, 42, 43,
	41, 42, 43,
	41, 42, 43,
	--51, 52, 53, 54, 55, 56, 57, 58  --花
}

--万 == id
--筒 == id-1
--条 == id-2
--风 == id-3
--箭 == id-9
mjCardIndex = {}  --存储42个 1-9:万 10-18:筒 19-27:条 28-31:(东南西北) 32-34:(中发白)
for i=1, 42 do
	mjCardIndex[i] = 0
end

mjCardTxt = {
	"一万","二万","三万","四万","五万","六万","七万","八万","九万",  
    "一筒","二筒","三筒","四筒","五筒","六筒","七筒","八筒","九筒",  
    "一索","二索","三索","四索","五索","六索","七索","八索","九索",  
    "东", "南", "西", "北", "中", "发", "白",  
    "春", "夏", "秋", "冬", "梅", "兰", "竹", "菊"  
}

--牌型定义
mjPatternType = {
	unknow = 0,
	shunzi = 1,
	kezi = 2,
	gangzi = 3,
	jiang = 4
}